       IDENTIFICATION DIVISION.
           PROGRAM-ID.  HELLO-WORLD.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           01  WS-HELLO-WORLD PIC X(11) VALUE 'HELLO WORLD'.
       PROCEDURE DIVISION.
            DISPLAY WS-HELLO-WORLD.
            STOP RUN.

